import React from "react";
import Table from "react-bootstrap/Table";

export default function Countries() {
  return (
    <div>
      <h2 className="countries">Основні країни світу</h2>
      <h3>Європа</h3>
      <Table striped bordered hover>
        <thead>
          <tr>
            <th>#</th>
            <th>Назва країни</th>
            <th>Ідеологія</th>
            <th>Опис</th>
            <th>Складність</th>
          </tr>
        </thead>
        <tbody>
          <tr>
            <td>1</td>
            <td>Germany</td>
            <td>Фашизм</td>
            <td>
              Націонал-соціалістична Німеччина, також відома як Третій Рейх,
              була нацистською диктатурою під керівництвом Адольфа Гітлера з
              1933 по 1945 рік.
            </td>
            <td>Висока</td>
          </tr>
          <tr>
            <td>2</td>
            <td>Soviet Union</td>
            <td>Комунізм</td>
            <td>
              Радянський Союз — соціалістична держава, яка існувала з 1922 по
              1991 рік.
            </td>
            <td>Висока</td>
          </tr>
          <tr>
            <td>3</td>
            <td>United Kingdom</td>
            <td>Лібералізм</td>
            <td>
              Сполучене Королівство Великої Британії і Північної Ірландії —
              конституційна монархія, що складається з чотирьох країн: Англії,
              Шотландії, Уельсу та Північної Ірландії.
            </td>
            <td>Висока</td>
          </tr>
          <tr>
            <td>4</td>
            <td>France</td>
            <td>Лібералізм</td>
            <td>
              Франція — республіка в Західній Європі. Її територія включає
              метрополію у західній Європі і різні заморські регіони і території
              по всьому світу.
            </td>
            <td>Середня</td>
          </tr>
          <tr>
            <td>5</td>
            <td>Italy</td>
            <td>Фашизм</td>
            <td>
              Італія — парламентська республіка в південній Європі, розташована
              на Апеннінському півострові, а також на численних островах.
            </td>
            <td>Середня</td>
          </tr>
          <tr>
            <td>6</td>
            <td>Spain</td>
            <td>Фашизм</td>
            <td>
              Іспанія — держава в південно-західній Європі і на атлантичному
              півдні Євразії, на Піренейському півострові. Столиця — Мадрид.
            </td>
            <td>Середня</td>
          </tr>
          <tr>
            <td>7</td>
            <td>Albania</td>
            <td>Фашизм</td>
            <td>
              Албанія — держава в Південно-Східній Європі на Балканському
              півострові.
            </td>
            <td>Низька</td>
          </tr>
          <tr>
            <td>8</td>
            <td>Austria</td>
            <td>Фашизм</td>
            <td>
              Австрія — держава в центральній Європі. Площа Австрії становить 83
              879 км², а населення — понад 8,9 млн осіб.
            </td>
            <td>Низька</td>
          </tr>
          <tr>
            <td>9</td>
            <td>Belgium</td>
            <td>Лібералізм</td>
            <td>
              Бельгія — парламентська монархія в Західній Європі. Столиця —
              місто Брюссель.
            </td>
            <td>Низька</td>
          </tr>
          <tr>
            <td>10</td>
            <td>Bulgaria</td>
            <td>Фашизм</td>
            <td>
              Болгарія — держава в Південно-Східній Європі, в східній частині
              Балканського півострова.
            </td>
            <td>Середня</td>
          </tr>
          <tr>
            <td>11</td>
            <td>Czechoslovakia</td>
            <td>Лібералізм</td>
            <td>
              Чехословаччина — історична держава в Центральній Європі, яка
              існувала з 1918 по 1992 рік.
            </td>
            <td>Середня</td>
          </tr>
          <tr>
            <td>12</td>
            <td>Denmark</td>
            <td>Лібералізм</td>
            <td>
              Данія — держава в Північній Європі, яка займає половину території
              однойменного острова, а також включає кілька супутніх малих
              островів.
            </td>
            <td>Низька</td>
          </tr>
          <tr>
            <td>13</td>
            <td>Estonia</td>
            <td>Лібералізм</td>
            <td>
              Естонія — держава в Північній Європі, на північному сході
              Балтійського моря.
            </td>
            <td>Середня</td>
          </tr>
          <tr>
            <td>14</td>
            <td>Finland</td>
            <td>Лібералізм</td>
            <td>
              Фінляндія — парламентська республіка в Північній Європі, член
              Європейського союзу.
            </td>
            <td>Середня</td>
          </tr>
          <tr>
            <td>15</td>
            <td>Greece</td>
            <td>Фашизм</td>
            <td>
              Греція — держава в Південній Європі, розташована на південному
              сході Балканського півострова.
            </td>
            <td>Середня</td>
          </tr>
          <tr>
            <td>16</td>
            <td>Hungary</td>
            <td>Фашизм</td>
            <td>
              Угорщина — держава в Центральній Європі. Площа країни становить 93
              036 км², а населення — близько 10 мільйонів осіб.
            </td>
            <td>Середня</td>
          </tr>
          <tr>
            <td>17</td>
            <td>Ireland</td>
            <td>Лібералізм</td>
            <td>
              Ірландія — держава в Західній Європі, яка займає більшу частину
              однойменного острова.
            </td>
            <td>Середня</td>
          </tr>
          <tr>
            <td>18</td>
            <td>Latvia</td>
            <td>Лібералізм</td>
            <td>
              Латвія — держава в Північній Європі, входить до складу
              Європейського Союзу, Європейського економічного простору,
              Шенгенської зони та НАТО.
            </td>
            <td>Середня</td>
          </tr>
          <tr>
            <td>19</td>
            <td>Lithuania</td>
            <td>Лібералізм</td>
            <td>
              Литва — держава в Північній Європі, одна з трьох прибалтійських
              країн.
            </td>
            <td>Середня</td>
          </tr>
          <tr>
            <td>20</td>
            <td>Luxembourg</td>
            <td>Лібералізм</td>
            <td>
              Люксембург — держава в Західній Європі, яка стала засновником
              Бенельксу, Співтовариства і Європейського Союзу.
            </td>
            <td>Середня</td>
          </tr>
          <tr>
            <td>21</td>
            <td>Netherlands</td>
            <td>Лібералізм</td>
            <td>
              Нідерланди — держава в Західній Європі, що займається великою
              частиною території Західної Європи, північніше Бельгії, на берегах
              Нідерландської Рейну і прилеглих до нього територіях.
            </td>
            <td>Середня</td>
          </tr>
          <tr>
            <td>22</td>
            <td>Norway</td>
            <td>Лібералізм</td>
            <td>
              Норвегія — королівство в Північній Європі, розташоване на західній
              частині Скандинавського півострова, крайня східна частина країни
              лежить на Східній Європі.
            </td>
            <td>Середня</td>
          </tr>
          <tr>
            <td>23</td>
            <td>Poland</td>
            <td>Лібералізм</td>
            <td>
              Польща — держава в Центральній Європі, що межує з Німеччиною на
              заході, Чехією і Словаччиною на півдні, Україною та Білоруссю на
              сході, Литвою на північному сході і з Калінінградською областю
              Росії на півночі.
            </td>
            <td>Середня</td>
          </tr>
          <tr>
            <td>24</td>
            <td>Portugal</td>
            <td>Лібералізм</td>
            <td>
              Португалія — держава в Південній Європі, на південному сході
              Піренейського півострова.
            </td>
            <td>Середня</td>
          </tr>
          <tr>
            <td>25</td>
            <td>Romania</td>
            <td>Фашизм</td>
            <td>
              Румунія — держава в Південно-Східній Європі. Це східна держава
              Європи, що розташована в центральній і південно-східній частині
              Балканського півострова.
            </td>
            <td>Середня</td>
          </tr>
          <tr>
            <td>26</td>
            <td>Slovakia</td>
            <td>Фашизм</td>
            <td>
              Словаччина — держава в Центральній Європі. Площа країни становить
              49 035 км², а населення — близько 5,5 мільйонів осіб.
            </td>
            <td>Середня</td>
          </tr>
          <tr>
            <td>27</td>
            <td>Sweden</td>
            <td>Лібералізм</td>
            <td>
              Швеція — конституційна монархія, розташована на східному краю
              Скандинавського півострова.
            </td>
            <td>Середня</td>
          </tr>
          <tr>
            <td>28</td>
            <td>Switzerland</td>
            <td>Лібералізм</td>
            <td>
              Швейцарія — федеративна республіка, держава в Західній Європі, яка
              складається з 26 кантонів.
            </td>
            <td>Середня</td>
          </tr>
          <tr>
            <td>29</td>
            <td>Turkey</td>
            <td>Фашизм</td>
            <td>
              Туреччина — держава в Євразії, що займає південно-східну частину
              Південно-західної Азії і найзахіднішу частину Північно-Східної
              Азії.
            </td>
            <td>Середня</td>
          </tr>
          <tr>
            <td>30</td>
            <td>United Kingdom</td>
            <td>Лібералізм</td>
            <td>
              Сполучене Королівство Великої Британії і Північної Ірландії —
              конституційна монархія, що складається з чотирьох країн: Англії,
              Шотландії, Уельсу та Північної Ірландії.
            </td>
            <td>Середня</td>
          </tr>
          <tr>
            <td>31</td>
            <td>Yugoslavia</td>
            <td>Фашизм</td>
            <td>
              Югославія — держава в Південно-Східній Європі, яка існувала з 1918
              по 1992 рік.
            </td>
            <td>Середня</td>
          </tr>
        </tbody>
      </Table>

      <h3>Північна Америка і Вест-Індія</h3>
      <Table striped bordered hover>
        <thead>
          <tr>
            <th>#</th>
            <th>Назва країни</th>
            <th>Ідеологія</th>
            <th>Опис</th>
            <th>Складність</th>
          </tr>
        </thead>
        <tbody>
          <tr>
            <td>1</td>
            <td>Canada</td>
            <td>Лібералізм</td>
            <td>
              Канада — парламентська монархія в Північній Америці, втора за
              площею країна в світі.
            </td>
            <td>Середня</td>
          </tr>
          <tr>
            <td>2</td>
            <td>United States</td>
            <td>Лібералізм</td>
            <td>
              Сполучені Штати Америки — федеративна конституційна республіка, що
              складається з 50 штатів, один з яких — Гаваї — розташований в
              Північному Тихому океані, біля західніх берегів США.
            </td>
            <td>Середня</td>
          </tr>
          <tr>
            <td>3</td>
            <td>Mexico</td>
            <td>Фашизм</td>
            <td>
              Мексика — держава в Північній Америці. Площа країни становить 1
              964 375 км², що робить її 15-ою за величиною країною в світі.
            </td>
            <td>Середня</td>
          </tr>
        </tbody>
      </Table>

      <h3>Південна Америка</h3>
      <Table striped bordered hover>
        <thead>
          <tr>
            <th>#</th>
            <th>Назва країни</th>
            <th>Ідеологія</th>
            <th>Опис</th>
            <th>Складність</th>
          </tr>
        </thead>
        <tbody>
          <tr>
            <td>1</td>
            <td>Argentina</td>
            <td>Лібералізм</td>
            <td>
              Аргентина — федеративна республіка в Південній Америці, в
              переважній більшості знаходиться на південному краю
              Южноамериканського континенту.
            </td>
            <td>Середня</td>
          </tr>
          <tr>
            <td>2</td>
            <td>Brazil</td>
            <td>Фашизм</td>
            <td>
              Бразилія — федеративна республіка в Південній Америці, найбільша
              за територією і населенням країна Латинської Америки.
            </td>
            <td>Середня</td>
          </tr>
          <tr>
            <td>3</td>
            <td>Chile</td>
            <td>Лібералізм</td>
            <td>
              Чилі — держава в Південній Америці, розташована на південному
              заході континенту.
            </td>
            <td>Середня</td>
          </tr>
          <tr>
            <td>4</td>
            <td>Colombia</td>
            <td>Лібералізм</td>
            <td>
              Колумбія — держава в Південній Америці, розташована в
              північно-західній частині Південної Америки.
            </td>
            <td>Середня</td>
          </tr>
          <tr>
            <td>5</td>
            <td>Peru</td>
            <td>Лібералізм</td>
            <td>
              Перу — держава в Західній Південній Америці, що займає перуанський
              територіальний коридор на Південноамериканському континенті.
            </td>
            <td>Середня</td>
          </tr>
          <tr>
            <td>6</td>
            <td>Venezuela</td>
            <td>Фашизм</td>
            <td>
              Венесуела — держава в Південній Америці, розташована в північній
              частині Південної Америки.
            </td>
            <td>Середня</td>
          </tr>
        </tbody>
      </Table>

      <h3>Азія</h3>
      <Table striped bordered hover>
        <thead>
          <tr>
            <th>#</th>
            <th>Назва країни</th>
            <th>Ідеологія</th>
            <th>Опис</th>
            <th>Складність</th>
          </tr>
        </thead>
        <tbody>
          <tr>
            <td>1</td>
            <td>Afghanistan</td>
            <td>Лібералізм</td>
            <td>
              Афганістан — країна в Південній Азії, що займає центральну і
              південну частини регіону Південної Азії.
            </td>
            <td>Середня</td>
          </tr>
          <tr>
            <td>2</td>
            <td>China</td>
            <td>Фашизм</td>
            <td>
              Китай — країна в Східній Азії. Найбільша за чисельністю населення
              країна у світі.
            </td>
            <td>Складна</td>
          </tr>
          <tr>
            <td>3</td>
            <td>India</td>
            <td>Фашизм</td>
            <td>
              Індія — країна в Південній Азії, що займає більшу частину
              Індійського півострова.
            </td>
            <td>Складна</td>
          </tr>
          <tr>
            <td>4</td>
            <td>Iran</td>
            <td>Фашизм</td>
            <td>
              Іран — держава в Південно-Західній Азії, на південному заході
              Центральної Азії і західному узбережжі Азійського материка.
            </td>
            <td>Складна</td>
          </tr>
          <tr>
            <td>5</td>
            <td>Japan</td>
            <td>Фашизм</td>
            <td>
              Японія — острівна держава в Східній Азії. Розташована в Тихому
              океані, на сході від західного узбережжя Північної Америки.
            </td>
            <td>Складна</td>
          </tr>
          <tr>
            <td>6</td>
            <td>South Korea</td>
            <td>Лібералізм</td>
            <td>
              Південна Корея — держава в Східній Азії, розташована на південному
              сході азійського материка. Її територія охоплює південну частину
              Корейського півострова, включаючи численні прибережні острови.
            </td>
            <td>Середня</td>
          </tr>
          <tr>
            <td>7</td>
            <td>North Korea</td>
            <td>Фашизм</td>
            <td>
              Північна Корея — держава в Східній Азії. Розташована на північному
              сході азійського материка, на півночі Корейського півострова.
            </td>
            <td>Складна</td>
          </tr>
          <tr>
            <td>8</td>
            <td>Pakistan</td>
            <td>Фашизм</td>
            <td>
              Пакистан — країна в Південній Азії. Займає територію Південної
              Азії, а також окремих областей Південно-Східної Азії.
            </td>
            <td>Складна</td>
          </tr>
          <tr>
            <td>9</td>
            <td>Philippines</td>
            <td>Лібералізм</td>
            <td>
              Філіппіни — острівна держава в Південно-Східній Азії, що
              складається з 7107 островів.
            </td>
            <td>Середня</td>
          </tr>
          <tr>
            <td>10</td>
            <td>Saudi Arabia</td>
            <td>Фашизм</td>
            <td>
              Саудівська Аравія — монархія на Аравійському півострові,
              розташована на заході від Затоки Перської.
            </td>
            <td>Середня</td>
          </tr>
          <tr>
            <td>11</td>
            <td>Thailand</td>
            <td>Фашизм</td>
            <td>
              Таїланд — країна в Південно-Східній Азії, розташована на південь
              від країн Південно-Східної Азії.
            </td>
            <td>Середня</td>
          </tr>
        </tbody>
      </Table>

      <h3>Південно-Східна Азія і Океанія</h3>
      <Table striped bordered hover>
        <thead>
          <tr>
            <th>#</th>
            <th>Назва країни</th>
            <th>Ідеологія</th>
            <th>Опис</th>
            <th>Складність</th>
          </tr>
        </thead>
        <tbody>
          <tr>
            <td>1</td>
            <td>Australia</td>
            <td>Лібералізм</td>
            <td>
              Австралія — держава на південному заході Тихого океану, на
              материковій частині Австралійського материка, на Тасманському
              плиті та численних прибережних островах.
            </td>
            <td>Середня</td>
          </tr>
          <tr>
            <td>2</td>
            <td>New Zealand</td>
            <td>Лібералізм</td>
            <td>
              Нова Зеландія — острівна держава в Південній частині Тихого
              океану, на краю Південно-Західної Акваторії.
            </td>
            <td>Середня</td>
          </tr>
          <tr>
            <td>3</td>
            <td>Philippines</td>
            <td>Лібералізм</td>
            <td>
              Філіппіни — острівна держава в Південно-Східній Азії, що
              складається з 7107 островів.
            </td>
            <td>Середня</td>
          </tr>
          <tr>
            <td>4</td>
            <td>Thailand</td>
            <td>Фашизм</td>
            <td>
              Таїланд — країна в Південно-Східній Азії, розташована на південь
              від країн Південно-Східної Азії.
            </td>
            <td>Середня</td>
          </tr>
        </tbody>
      </Table>
    </div>
  );
}
