import React from "react";

export default function Tutorial() {
  return (
    <div className="tutorial">
      <iframe
        className="video"
        width="560"
        height="315"
        src="https://www.youtube.com/embed/vkZAF0LqJ7c?si=8LtTxHvlV-vbx97Q"
        title="YouTube video player"
        frameborder="0"
        allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share"
        referrerpolicy="strict-origin-when-cross-origin"
        allowfullscreen
      ></iframe>

      <h1 className="h">Докторини</h1>
      <div className="images">
        <div>
          <h4>Сухопутна Доктрина </h4>
          <p></p>
          <img alt="img" src="doctorina.jpg" width={400} />
        </div>
        <div>
          <h4>морська Докторина </h4>
          <p></p>
          <img alt="img" src="doctorina1.png" width={400} />
        </div>
        <div>
          <h4>Повітряна Докторина </h4>
          <p></p>
          <img alt="img" src="doctorinaplane.jpeg" width={400} />
        </div>
      </div>
      <h1 className="h">Рішення</h1>
      <div className="container">
        <img alt="img" src="reh.jpg" width={900} className="imgreh" />
        <div className="content">
          <p className="textreh">
            1. Політичні рішення: Ці рішення стосуються внутрішньої політики
            вашої країни, таких як зміни урядового устрою, програми соціального
            забезпечення, податкові політики тощо. <br />
            2. Дипломатичні рішення: Ці рішення впливають на зовнішні відносини
            вашої країни, такі як укладення альянсів, підписання мирних угод або
            декларацій війни. <br />
            3. Військові рішення: Ці рішення стосуються вашої військової
            стратегії, такі як мобілізація армії, військові реформи, виконання
            спеціальних операцій тощо.
          </p>
        </div>
      </div>
      <h1 className="h">Агенство</h1>
      <div className="container">
        <img alt="img" src="agent.jpg" width={400} className="imgreh" />
        <div className="content">
          <p className="textreh">
            Розвідувальна агенція - створюване гравцем агентство, що дозволяє
            гравцеві наймати агентів для збору розвіданих та розшифровувати
            ворожі шифри
            <ul>
              <li>Разведка</li>
              <li>Оборона</li>
              <li>Операции</li>
              <li>Обучение агента</li>
              <li>Департамент криптологии</li>
            </ul>
          </p>
        </div>
      </div>
      <h1 className="h">Торгівля</h1>
      <div className="container">
        <img alt="img" src="torg.jpg" width={3000} className="imgreh" />
        <div className="content">
          <p className="textreh">
            Торгівля — це ігрова механіка, що дозволяє країнам купувати ресурси
            за фабрики і навпаки.<h4>Законы о торгівлі</h4>
            Одним из трёх типов законов являются законы, регулирующие торговлю.
            Эти законы определяют тот процент ресурсов, добываемых в стране,
            которые будут предназначены для продажи в других странах. Эти
            ресурсы не могут быть использованы в производстве вне зависимости от
            того, экспортируются они куда-либо в действительности или нет.
            Например, если у какого-то ресурса, направленного на продажу, нет
            покупателя, он не будет использоваться даже в случае нехватки у
            страны-производителя, и все время будет доступен на глобальном
            рынке. В игре представлено 5 законов о торговле, каждый из которых
            предоставляет различные бонусы, отображая влияние торговли с другими
            странами на развитие внутренней экономики.
          </p>
        </div>
      </div>

      <h1 className="h">Будівництво в регіонах</h1>
      <div className="container">
        <img alt="img" src="build.jpg" width={400} className="imgreh" />
        <div className="content">
          <p className="textreh">
            <ul>
              <li>
                <strong>Фабрика</strong>
                <ul>
                  <li>Гражданская фабрика</li>
                  <li>Стоимость строительства: 10800</li>
                  <li>Максимальный уровень: 20</li>
                  <li>Стоимость конверсии: 9000</li>
                  <li>
                    Гражданская фабрика — основа экономики государства. Именно
                    фабрики служат местом производства потребительских товаров и
                    торговли, а также используются для строительства объектов.
                    Также фабрики можно конвертировать в военные заводы за 9000.
                  </li>
                </ul>
              </li>
              <li>
                <strong>Военный завод</strong>
                <ul>
                  <li>Военный завод</li>
                  <li>Стоимость строительства: 7200</li>
                  <li>Максимальный уровень: 20</li>
                  <li>Стоимость конверсии: 4000</li>
                  <li>
                    Военные заводы служат для производства снаряжения. Именно на
                    них производят танки, самолёты, автомобили и прочее
                    оборудование для войск. Военный завод также можно превратить
                    в гражданскую фабрику за 4000.
                  </li>
                </ul>
              </li>
              <li>
                <strong>Верфь</strong>
                <ul>
                  <li>Верфь</li>
                  <li>Стоимость строительства: 6300</li>
                  <li>Максимальный уровень: 10</li>
                  <li>Верфи строят и чинят корабли.</li>
                </ul>
              </li>
              <li>
                <strong>Нефтеперерабатывающий завод</strong>

                <ul>
                  <li>Нефтеперерабатывающий завод</li>
                  <li>Стоимость строительства: 14500</li>
                  <li>Максимальный уровень: 3</li>
                  <li>
                    Нефтеперерабатывающий завод производит топливо и резину.
                  </li>
                </ul>
              </li>
              <li>
                <strong>Топливное хранилище</strong>
                <ul>
                  <li>Топливное хранилище</li>
                  <li>Стоимость строительства: 5000</li>
                  <li>Максимальный уровень: -</li>
                  <li>Топливное хранилище накапливает топливо.</li>
                </ul>
              </li>
              <li>
                <strong>Ракетная площадка</strong>
                <ul>
                  <li>Ракетная площадка</li>
                  <li>Стоимость строительства: 6400</li>
                  <li>Максимальный уровень: 5</li>
                </ul>
              </li>
              <li>
                <strong>Ядерный реактор</strong>
                <ul>
                  <li>Ядерный реактор</li>
                  <li>Стоимость строительства: 30000</li>
                  <li>Максимальный уровень: 1</li>
                </ul>
              </li>
              <li>
                <strong>Морская база</strong>
                <ul>
                  <li>Морская база</li>
                  <li>Стоимость строительства: 3000</li>
                  <li>Максимальный уровень: 10</li>
                </ul>
              </li>
              <li>
                <strong>Укрепления</strong>
                <ul>
                  <li>Укрепления</li>
                  <li>Стоимость строительства: 500</li>
                  <li>Максимальный уровень: 10</li>
                </ul>
              </li>
              <li>
                <strong>Береговые укрепления</strong>
                <ul>
                  <li>Береговые укрепления</li>
                  <li>Стоимость строительства: 500</li>
                  <li>Максимальный уровень: 10</li>
                </ul>
              </li>
            </ul>
          </p>
        </div>
      </div>

      <h1 className="h">Агенство</h1>
      <div className="container">
        <img alt="img" src="agent.jpg" width={400} className="imgreh" />
        <div className="content">
          <p className="textreh">
            Розвідувальна агенція - створюване гравцем агентство, що дозволяє
            гравцеві наймати агентів для збору розвіданих та розшифровувати
            ворожі шифри
            <ul>
              <li>Разведка</li>
              <li>Оборона</li>
              <li>Операции</li>
              <li>Обучение агента</li>
              <li>Департамент криптологии</li>
            </ul>
          </p>
        </div>
      </div>

      <h1 className="h">дослідження</h1>
      <div className="container">
        <img alt="img" src="agent.jpg" width={400} className="imgreh" />
        <div className="content">
          <p className="textreh">
            Технології дозволяють країнам відкривати нові бойові одиниці, такі
            як моторизована піхота, повітрянодесантні війська, танки і всі види
            авіації; нове спорядження, від зброї піхоти до авіагруп для
            авіаносців та спеціалізованих броньованих одиниць; а також оборонні
            та промислові споруди. З іншого боку, багато технологій відповідають
            за підвищення ефективності наявних бойових одиниць. Це досягається
            різними способами, від збільшення нанесеної шкоди, можливості
            пробивати броню захищених одиниць, їх оборону та організацію або
            просто можливість виявляти ворожі одиниці.
            <ul>
              <li>Сухопутні</li>
              <li>Морські</li>
              <li>Повітряні</li>
              <li>Промишлені</li>
            </ul>
          </p>
        </div>
      </div>

      <h1 className="h">Дипломатія</h1>
      <div className="container">
        <img alt="img" src="deplo.jpeg" width={400} className="imgreh" />
        <div className="content">
          <p className="textreh">
            Дипломатія - система взаємовідносин між державами в Hearts of Iron
            IV. Здебільшого дипломатія у HoI4 є двосторонньою
            <ul>
              <li>"Оправдати ціль війни"</li>
              <li>"Оголосити війну"</li> <li>"Гарантувати незалежність"</li>
              <li>"Право проходу"</li>
              <li>"Покращити відносини"</li> <li>"Пакт про ненапад"</li>
              <li>"Альянс"</li>{" "}
              <li>"Добровольці, експедиційні корпуси та ленд-ліз"</li>{" "}
              <li>"Збільшити популярність партії"</li>{" "}
              <li>"Підготувати переворот"</li> <li>"Контроль над регіонами"</li>
              <li>"Підтримка гарнізонів"</li>
            </ul>
          </p>
        </div>
      </div>

      <h1 className="h">виробництво спорядження</h1>
      <div className="container">
        <img alt="img" src="indu.jpg" width={400} className="imgreh" />
        <div className="content">
          <p className="textreh">
            У Hearts of Iron IV (HoI4), виробництво спорядження є ключовим
            елементом управління державою та армією. Виробництво спорядження
            охоплює різні аспекти, пов'язані зі створенням озброєння, техніки та
            інших матеріалів, необхідних для ведення війни. Ось основні типи
            спорядження, яке можна виробляти в HoI4
            <ul>
              <li>Піхотне спорядження</li>
              <li>Артилерія</li>
              <li>Бронетехніка</li>
              <li>Моторизована техніка</li>
              <li>Автомобілі та підтримка</li>
              <li>Військова авіація</li>
              <li>Військово-морський флот</li>
              <li>Паливо та ресурси</li>
            </ul>
          </p>
        </div>
      </div>

      <h1 className="h">Вербування дивізій</h1>
      <div className="container">
        <img alt="img" src="roz.jpg" width={1000} className="imgreh" />
        <div className="content">
          <p className="textreh">
            <h4 className="h">Вербування дивізій</h4>
            <li>
              У вкладці «Вербування та розгортання» виберіть шаблон дивізії, яку
              ви хочете створити. Вкажіть кількість дивізій, які ви хочете
              створити, та призначте регіон, де вони будуть тренуватися.
            </li>

            <li>
              У вкладці «Вербування та розгортання» виберіть шаблон дивізії, яку
              ви хочете створити. Вкажіть кількість дивізій, які ви хочете
              створити, та призначте регіон, де вони будуть тренуватися.
            </li>
            <h4 className="h">Тренування дивізій</h4>
            <li>
              Після початку вербування дивізії почнуть тренуватися у вибраному
              регіоні. Тренування триває певний час, залежно від типу дивізії та
              наявності необхідного спорядження.
            </li>
            <h4 className="h">Розгортання дивізій</h4>
            <li>
              Після завершення тренування дивізії готові до розгортання. Ви
              можете розгорнути їх у вибраному регіоні або безпосередньо на
              фронті, якщо це дозволяє логістика та наявність шляхів постачання.
            </li>
          </p>
        </div>
      </div>
    </div>
  );
}
